#pragma once

// Base
#include "IScene.h"

// 2D

// 3D

// Object

// Managers
#include "InputManager.h"
#include "TextureManager.h"

// Audio

// c++


/*////////////////////////////////////////////////////////////////////////////////
*
*								TitleScene Class
*
////////////////////////////////////////////////////////////////////////////////*/
class TitleScene :
	public IScene {
public:
	/*-----------------------------*/
	///			メンバ関数
	/*-----------------------------*/

	TitleScene();
	~TitleScene();

	void Initialize()override;
	void Update()override;
	void Draw()override;

private:
	/*-----------------------------*/
	///			メンバ変数
	/*-----------------------------*/

	// 入力
	InputManager* input_ = nullptr;
	// テクスチャ
	TextureManager* textureManager_ = nullptr;
	
	/*----------------------------------------------------------------------*/
	// 2Dオブジェクト



	/*----------------------------------------------------------------------*/
	// 3Dオブジェクト



	/*----------------------------------------------------------------------*/
	// 3Dモデル



	/*----------------------------------------------------------------------*/
	// パーティクル



};