#include "TutorialScene.h"

#include "SceneManager.h"
#include "ImGuiManager.h"

/*////////////////////////////////////////////////////////////////////////////////
*								コンストラクタ
////////////////////////////////////////////////////////////////////////////////*/
TutorialScene::TutorialScene() {}

/*////////////////////////////////////////////////////////////////////////////////
*								  デストラクタ
////////////////////////////////////////////////////////////////////////////////*/
TutorialScene::~TutorialScene() {}


/*////////////////////////////////////////////////////////////////////////////////
*									 初期化
////////////////////////////////////////////////////////////////////////////////*/
void TutorialScene::Initialize() {

	/*======================================================*/
	// テクスチャ読み込み

	// 背景画像
	NewMoon::LoadTexture("./Resources/Images/Common/Backgrounds/" + bgTextureName_);
	NewMoon::LoadTexture("./Resources/Images/Common/Backgrounds/" + bgGridTextureName_);

	/*======================================================*/
	// 2Dオブジェクト

	// 背景画像
	for (uint32_t i = 0; i < backgrounds_.size(); i++) {

		backgrounds_[i] = std::make_unique<GameObject2D>();
		backgrounds_[i]->Initialize();
	}
	backgrounds_[0]->SetTexture(bgTextureName_);
	backgrounds_[1]->SetTexture(bgGridTextureName_);

	/*======================================================*/
	// 3Dオブジェクト



}



/*////////////////////////////////////////////////////////////////////////////////
*								    更新処理
////////////////////////////////////////////////////////////////////////////////*/
void TutorialScene::Update() {

	/*======================================================*/
	// ImGui

	ImGui::Begin("TutorialScene");
	ImGui::Text("SpaceKey: Tutorial -> Select");
	ImGui::End();

	/*======================================================*/
	// シーン遷移処理

	// Tutorial -> Select
	if (NewMoon::TriggerKey(DIK_SPACE)) {

		SceneManager::GetInstance()->ChangeScene(SELECT);
	}

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト



}

/*////////////////////////////////////////////////////////////////////////////////
*								    描画処理
////////////////////////////////////////////////////////////////////////////////*/
void TutorialScene::Draw() {

	/*======================================================*/
	// 2Dオブジェクト

	// 背景画像
	for (const auto& background : backgrounds_) {

		background->Draw();
	}

	/*======================================================*/
	// 3Dオブジェクト



}